Legohead259/Project-Thetis-Arduino/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type

#####################
### THETIS REV F4 ###
#####################

thetis_rev_f4.name=Thetis Rev F4
thetis_rev_f4.vid.0=0x303a
thetis_rev_f4.pid.0=0x0002

thetis_rev_f4.bootloader.tool=esptool_py
thetis_rev_f4.bootloader.tool.default=esptool_py

thetis_rev_f4.upload.tool=esptool_py
thetis_rev_f4.upload.tool.default=esptool_py
thetis_rev_f4.upload.tool.network=esp_ota

thetis_rev_f4.upload.maximum_size=1310720
thetis_rev_f4.upload.maximum_data_size=327680
thetis_rev_f4.upload.flags=
thetis_rev_f4.upload.extra_flags=
thetis_rev_f4.upload.use_1200bps_touch=false
thetis_rev_f4.upload.wait_for_upload_port=false

thetis_rev_f4.serial.disableDTR=false
thetis_rev_f4.serial.disableRTS=false

thetis_rev_f4.build.tarch=xtensa
thetis_rev_f4.build.bootloader_addr=0x1000
thetis_rev_f4.build.target=esp32s2
thetis_rev_f4.build.mcu=esp32s2
thetis_rev_f4.build.core=esp32
thetis_rev_f4.build.variant=thetis_rev_f4
thetis_rev_f4.build.board=THETIS_REVF4

thetis_rev_f4.build.cdc_on_boot=0
thetis_rev_f4.build.msc_on_boot=0
thetis_rev_f4.build.dfu_on_boot=0
thetis_rev_f4.build.f_cpu=240000000L
thetis_rev_f4.build.flash_size=4MB
thetis_rev_f4.build.flash_freq=80m
thetis_rev_f4.build.flash_mode=dio
thetis_rev_f4.build.boot=qio
thetis_rev_f4.build.partitions=default
thetis_rev_f4.build.defines=

thetis_rev_f4.menu.CDCOnBoot.default=Disabled
thetis_rev_f4.menu.CDCOnBoot.default.build.cdc_on_boot=0
thetis_rev_f4.menu.CDCOnBoot.cdc=Enabled
thetis_rev_f4.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

thetis_rev_f4.menu.MSCOnBoot.default=Disabled
thetis_rev_f4.menu.MSCOnBoot.default.build.msc_on_boot=0
thetis_rev_f4.menu.MSCOnBoot.msc=Enabled
thetis_rev_f4.menu.MSCOnBoot.msc.build.msc_on_boot=1

thetis_rev_f4.menu.DFUOnBoot.default=Disabled
thetis_rev_f4.menu.DFUOnBoot.default.build.dfu_on_boot=0
thetis_rev_f4.menu.DFUOnBoot.dfu=Enabled
thetis_rev_f4.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

thetis_rev_f4.menu.UploadMode.default=UART0
thetis_rev_f4.menu.UploadMode.default.upload.use_1200bps_touch=false
thetis_rev_f4.menu.UploadMode.default.upload.wait_for_upload_port=false
thetis_rev_f4.menu.UploadMode.cdc=Internal USB
thetis_rev_f4.menu.UploadMode.cdc.upload.use_1200bps_touch=true
thetis_rev_f4.menu.UploadMode.cdc.upload.wait_for_upload_port=true

thetis_rev_f4.menu.PSRAM.disabled=Disabled
thetis_rev_f4.menu.PSRAM.disabled.build.defines=
thetis_rev_f4.menu.PSRAM.enabled=Enabled
thetis_rev_f4.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

thetis_rev_f4.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.default.build.partitions=default
thetis_rev_f4.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
thetis_rev_f4.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
thetis_rev_f4.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
thetis_rev_f4.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
thetis_rev_f4.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
thetis_rev_f4.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.minimal.build.partitions=minimal
thetis_rev_f4.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.no_ota.build.partitions=no_ota
thetis_rev_f4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
thetis_rev_f4.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
thetis_rev_f4.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
thetis_rev_f4.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
thetis_rev_f4.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
thetis_rev_f4.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
thetis_rev_f4.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
thetis_rev_f4.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
thetis_rev_f4.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
thetis_rev_f4.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.huge_app.build.partitions=huge_app
thetis_rev_f4.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
thetis_rev_f4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
thetis_rev_f4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
thetis_rev_f4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
thetis_rev_f4.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
thetis_rev_f4.menu.PartitionScheme.fatflash.build.partitions=ffat
thetis_rev_f4.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
thetis_rev_f4.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
thetis_rev_f4.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
thetis_rev_f4.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
thetis_rev_f4.menu.PartitionScheme.rainmaker=RainMaker
thetis_rev_f4.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
thetis_rev_f4.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

thetis_rev_f4.menu.CPUFreq.240=240MHz (WiFi)
thetis_rev_f4.menu.CPUFreq.240.build.f_cpu=240000000L
thetis_rev_f4.menu.CPUFreq.160=160MHz (WiFi)
thetis_rev_f4.menu.CPUFreq.160.build.f_cpu=160000000L
thetis_rev_f4.menu.CPUFreq.80=80MHz (WiFi)
thetis_rev_f4.menu.CPUFreq.80.build.f_cpu=80000000L
thetis_rev_f4.menu.CPUFreq.40=40MHz
thetis_rev_f4.menu.CPUFreq.40.build.f_cpu=40000000L
thetis_rev_f4.menu.CPUFreq.20=20MHz
thetis_rev_f4.menu.CPUFreq.20.build.f_cpu=20000000L
thetis_rev_f4.menu.CPUFreq.10=10MHz
thetis_rev_f4.menu.CPUFreq.10.build.f_cpu=10000000L

thetis_rev_f4.menu.FlashMode.qio=QIO
thetis_rev_f4.menu.FlashMode.qio.build.flash_mode=dio
thetis_rev_f4.menu.FlashMode.qio.build.boot=qio
thetis_rev_f4.menu.FlashMode.dio=DIO
thetis_rev_f4.menu.FlashMode.dio.build.flash_mode=dio
thetis_rev_f4.menu.FlashMode.dio.build.boot=dio
thetis_rev_f4.menu.FlashMode.qout=QOUT
thetis_rev_f4.menu.FlashMode.qout.build.flash_mode=dout
thetis_rev_f4.menu.FlashMode.qout.build.boot=qout
thetis_rev_f4.menu.FlashMode.dout=DOUT
thetis_rev_f4.menu.FlashMode.dout.build.flash_mode=dout
thetis_rev_f4.menu.FlashMode.dout.build.boot=dout

thetis_rev_f4.menu.FlashFreq.80=80MHz
thetis_rev_f4.menu.FlashFreq.80.build.flash_freq=80m
thetis_rev_f4.menu.FlashFreq.40=40MHz
thetis_rev_f4.menu.FlashFreq.40.build.flash_freq=40m

thetis_rev_f4.menu.FlashSize.4M=4MB (32Mb)
thetis_rev_f4.menu.FlashSize.4M.build.flash_size=4MB
thetis_rev_f4.menu.FlashSize.8M=8MB (64Mb)
thetis_rev_f4.menu.FlashSize.8M.build.flash_size=8MB
thetis_rev_f4.menu.FlashSize.8M.build.partitions=default_8MB
thetis_rev_f4.menu.FlashSize.2M=2MB (16Mb)
thetis_rev_f4.menu.FlashSize.2M.build.flash_size=2MB
thetis_rev_f4.menu.FlashSize.2M.build.partitions=minimal
thetis_rev_f4.menu.FlashSize.16M=16MB (128Mb)
thetis_rev_f4.menu.FlashSize.16M.build.flash_size=16MB

thetis_rev_f4.menu.UploadSpeed.921600=921600
thetis_rev_f4.menu.UploadSpeed.921600.upload.speed=921600
thetis_rev_f4.menu.UploadSpeed.115200=115200
thetis_rev_f4.menu.UploadSpeed.115200.upload.speed=115200
thetis_rev_f4.menu.UploadSpeed.256000.windows=256000
thetis_rev_f4.menu.UploadSpeed.256000.upload.speed=256000
thetis_rev_f4.menu.UploadSpeed.230400.windows.upload.speed=256000
thetis_rev_f4.menu.UploadSpeed.230400=230400
thetis_rev_f4.menu.UploadSpeed.230400.upload.speed=230400
thetis_rev_f4.menu.UploadSpeed.460800.linux=460800
thetis_rev_f4.menu.UploadSpeed.460800.macosx=460800
thetis_rev_f4.menu.UploadSpeed.460800.upload.speed=460800
thetis_rev_f4.menu.UploadSpeed.512000.windows=512000
thetis_rev_f4.menu.UploadSpeed.512000.upload.speed=512000

thetis_rev_f4.menu.DebugLevel.none=None
thetis_rev_f4.menu.DebugLevel.none.build.code_debug=0
thetis_rev_f4.menu.DebugLevel.error=Error
thetis_rev_f4.menu.DebugLevel.error.build.code_debug=1
thetis_rev_f4.menu.DebugLevel.warn=Warn
thetis_rev_f4.menu.DebugLevel.warn.build.code_debug=2
thetis_rev_f4.menu.DebugLevel.info=Info
thetis_rev_f4.menu.DebugLevel.info.build.code_debug=3
thetis_rev_f4.menu.DebugLevel.debug=Debug
thetis_rev_f4.menu.DebugLevel.debug.build.code_debug=4
thetis_rev_f4.menu.DebugLevel.verbose=Verbose
thetis_rev_f4.menu.DebugLevel.verbose.build.code_debug=5
